window.dataLoaded = false;
let title_of_eom = themeOfDEC;
const data = {
    "index_1":{
        "subtitle": "Изучите методы диагностики и испытания электрического и электромеханического оборудования.",
        "step_of_popup": "Изучите методы диагностики и испытания электрического и электромеханического оборудования",
        "paragraph_1":[
            {"text": "К методам диагностики и испытания электрического и электромеханического оборудования относятся:"}
            //{"text2": "<b class='blue_header big_rectangle'>I. Общие положения</b>"},
        ],
        "paragraph_2":[
            //{"image": true, "image_path": "./content/image_2_1.png", "img_sign": "Рисунок 1. - Автоматический выключатель"},
            {"text2": "<b class='blue_header big_rectangle'>1. Визуальный осмотр</b>"},
            {"text": "Это первый шаг в процессе диагностики, который позволяет выявить видимые повреждения, такие как трещины, сколы, коррозию, перегрев или другие дефекты."}
            //{"text": "<b class='blue_header '>I. Общие положения</b>"},
        ],
        "paragraph_3":[
            {"text2": "<b class='blue_header big_rectangle'>2. Проверка изоляции</b>"},
            {"text": "Этот метод включает измерение сопротивления изоляции с помощью мегаомметра для определения её состояния и выявления возможных утечек тока."},
            {"text2": "<b class='blue_header big_rectangle'>3. Испытание повышенным напряжением</b>"},
            {"text": "Метод заключается в подаче на оборудование повышенного напряжения для проверки его способности выдерживать нагрузки без повреждений."},
            {"text2": "<b class='blue_header big_rectangle'>4. Измерение параметров сети</b>"},
            {"text": "Сюда входят измерение напряжения, тока, частоты, коэффициента мощности (cos φ) и других параметров для оценки работы оборудования."},
            {"text2": "<b class='blue_header big_rectangle'>5. Тепловизионный контроль</b>"},
            {"text": "Использование тепловизора позволяет обнаружить места перегрева, которые могут указывать на проблемы с оборудованием."},
            {"text2": "<b class='blue_header big_rectangle'>6. Анализ шумов и вибраций</b>"},
            {"text": "Нехарактерные шумы и вибрации могут свидетельствовать о проблемах с подшипниками, вентиляторами и другими компонентами оборудования."},
            {"text2": "<b class='blue_header big_rectangle'>7. Проверка работоспособности электродвигателей</b>"},
            {"text": "Включает в себя тестирование обмотки двигателя, измерение сопротивления, проверку подшипников и другие процедуры для обеспечения надёжной работы."},
            {"text2": "<b class='blue_header big_rectangle'>8. Прогрузка автоматических выключателей</b>"},
            {"text": "Метод заключается в проверке срабатывания автоматических выключателей при различных токах короткого замыкания для обеспечения их правильной работы."},
            {"text2": "<b class='blue_header big_rectangle'>9. Функциональное тестирование</b>"},
            {"text": " Проверка работоспособности оборудования путём выполнения определённых функций и операций."},
            {"text2": "<b class='blue_header big_rectangle'>10. Спектральный анализ</b>"},
            {"text": "Анализ спектра частот может помочь выявить проблемы, связанные с гармониками и резонансами в системе."}
            ],   
        "paragraph_4":[
            {"image": true, "image_path": "./content/page_content/img1_1.png","img_sign": " "}
            ],
        "paragraph_5":[
            {"image": true, "image_path": "./content/page_content/img1_2.png","img_sign": " "}
            ],
        "paragraph_6":[
            {"text": ` 
            <p>
            <b class='blue_header'>Визуальный осмотр при диагностике и испытании электрического и электромеханического оборудования включает:</b></p>
            <ul class='ul_custom'>
                <li>проверку состояния корпуса на наличие повреждений, трещин, сколов или деформаций;</li>
                <li>оценку качества соединений кабелей и проводов, а также наличия коррозии или ослабленных контактов;</li>
                <li>контроль состояния переключателей, кнопок и других элементов управления на предмет износа или повреждений;</li>
                <li>осмотр защитных устройств (предохранителей, автоматических выключателей) на соответствие номинальным характеристикам и отсутствие видимых дефектов;</li>
                <li>проверку работы индикаторов, сигнальных ламп и дисплеев на корректность отображения информации;</li>
                <li>выявление утечек жидкостей или газов, которые могут указывать на проблемы с оборудованием;</li>
                <li>наблюдение за работой оборудования в процессе эксплуатации для выявления нехарактерных шумов, вибраций или запахов.</li>
            </ul>
            </p>
            <p>
            <b class='blue_header'>Проверка изоляции при диагностике и испытании электрического и электромеханического оборудования включает:</b></p>
            <ul class='ul_custom'>
                <li>измерение сопротивления изоляции с помощью мегаомметра для определения её состояния и выявления возможных утечек тока;</li>
                <li>проверку целостности изоляционных материалов, включая поиск трещин, разрывов или других повреждений;</li>
                <li>контроль влажности и загрязнения поверхности изоляторов, которые могут ухудшить их свойства;</li>
                <li>оценку качества соединений и монтажа, влияющих на эффективность изоляции;</li>
                <li>выявление возможных путей утечки тока через изоляцию.</li>
            </ul>
            </p>

            <p>
            <b class='blue_header'>Испытание повышенным напряжением при диагностике и испытании электрического и электромеханического оборудования включает:</b></p>
            <ul class='ul_custom'>
                <li>подачу на оборудование напряжения, превышающего номинальное, для проверки его способности выдерживать нагрузки без повреждений;</li>
                <li>оценку реакции оборудования на повышенное напряжение, включая контроль за возможными утечками тока или искрением;</li>
                <li>выявление слабых мест в изоляции и других компонентов оборудования, которые могут привести к отказам при эксплуатации.</li>
            </ul>
            </p>

            <p>
            <b class='blue_header'>Измерение параметров сети при диагностике и испытании электрического и электромеханического оборудования включает:</b></p>
            <ul class='ul_custom'>
                <li>замер напряжения, тока, частоты и коэффициента мощности (cos φ) для оценки работы оборудования;</li>
                <li>проверку соответствия параметров электросети требованиям производителя оборудования и нормативным документам;</li>
                <li>выявление отклонений от номинальных значений, которые могут указывать на проблемы с оборудованием или сетью;</li>
                <li>оценку качества электроэнергии, включая наличие гармоник, шумов и искажений.</li>
            </ul>
            </p>

            <p>
            <b class='blue_header'>Тепловизионный контроль при диагностике и испытании электрического и электромеханического оборудования включает:</b></p>
            <ul class='ul_custom'>
                <li>использование тепловизора для обнаружения мест перегрева, которые могут указывать на проблемы с оборудованием;</li>
                <li>проверку равномерности нагрева компонентов и выявление аномальных температурных зон;</li>
                <li>оценку эффективности системы охлаждения и теплоотвода в оборудовании;</li>
                <li>обнаружение скрытых дефектов, таких как короткие замыкания или повреждения изоляции, вызывающих перегрев;</li>
                <li>мониторинг состояния подшипников, трансформаторов и других критически важных компонентов.</li>
            </ul>
            </p>

            <p>
            <b class='blue_header'>Анализ шумов и вибраций при диагностике и испытании электрического и электромеханического оборудования включает:</b></p>
            <ul class='ul_custom'>
                <li>прослушивание и идентификацию характера шумов, исходящих от оборудования, для выявления аномалий;</li>
                <li>измерение уровня шума с помощью шумомера для количественной оценки;</li>
                <li>анализ причин возникновения шумов, таких как износ подшипников, проблемы с вентиляцией или электрические неисправности;</li>
                <li>проверку состояния механических компонентов, включая подшипники, валы и муфты, на предмет износа или повреждений;</li>
                <li>оценку вибраций оборудования для обнаружения дисбаланса, несоосности или других механических проблем;</li>
                <li>использование виброанализаторов для точного измерения и анализа вибраций.</li>
            </ul>
            </p>

            <p>
            <b class='blue_header'>Проверка работоспособности электродвигателей при диагностике и испытании электрического и электромеханического оборудования включает:</b></p>
            <ul class='ul_custom'>
                <li>тестирование обмотки двигателя на предмет обрыва или короткого замыкания;</li>
                <li>измерение сопротивления обмоток для проверки их целостности и состояния;</li>
                <li>проверку подшипников на наличие люфта, шума и перегрева;</li>
                <li>оценку работы системы охлаждения двигателя;</li>
                <li>контроль состояния клеммных соединений и кабелей питания;</li>
                <li>запуск двигателя в разных режимах работы для оценки его производительности и стабильности;</li>
                <li>выявление возможных причин снижения эффективности работы двигателя.</li>
            </ul>
            </p>

            <p>
            <b class='blue_header'>Прогрузка автоматических выключателей при диагностике и испытании электрического и электромеханического оборудования включает:</b></p>
            <ul class='ul_custom'>
                <li>проверку срабатывания автоматических выключателей при различных токах короткого замыкания;</li>
                <li>оценку времени срабатывания выключателя для обеспечения безопасности системы;</li>
                <li>измерение тока и напряжения в момент срабатывания для подтверждения соответствия номинальным характеристикам;</li>
                <li>выявление возможных неисправностей, таких как износ контактов или проблемы с механизмом расцепления;</li>
                <li>тестирование функций защиты от перегрузки и короткого замыкания.</li>
            </ul>
            </p>

            <p>
            <b class='blue_header'>Функциональное тестирование при диагностике и испытании электрического и электромеханического оборудования включает:</b></p>
            <ul class='ul_custom'>
                <li>проверку работоспособности всех функций оборудования в соответствии с его назначением;</li>
                <li>оценку производительности и эффективности работы оборудования;</li>
                <li>выявление возможных сбоев или ошибок в работе системы;</li>
                <li>тестирование программного обеспечения, управляющего оборудованием;</li>
                <li>проведение нагрузочных тестов для проверки стабильности работы под нагрузкой;</li>
                <li>выполнение специфических тестовых сценариев, разработанных для конкретного типа оборудования.</li>
            </ul>
            </p>

            <p>
            <b class='blue_header'>Спектральный анализ при диагностике и испытании электрического и электромеханического оборудования включает:</b></p>
            <ul class='ul_custom'>
                <li>измерение и анализ частотных составляющих в электрических сигналах для выявления проблем, связанных с гармониками и резонансами;</li>
                <li>оценку влияния нелинейных нагрузок на качество электроэнергии;</li>
                <li>диагностику состояния трансформаторов, генераторов и другого оборудования по их спектральным характеристикам;</li>
                <li>выявление скрытых дефектов, таких как повреждения изоляции или проблемы с подшипниками, по изменениям в спектре частот;</li>
                <li>оптимизацию работы систем электроснабжения на основе результатов спектрального анализа.</li>
            </ul>
            </p>
                `}
            ],
            "paragraph_7":[
            {"image": true, "image_path": "./content/page_content/img1_3.png","img_sign": " "}
            ],
            "paragraph_8":[
            {"text": `
                Перечисленные методы могут производится непосредственно человеком или автоматизированными системами диагностики (АСМД). <br>
                Помимо традиционных методов диагностики существуют и современные методы, основанные на цифровых технологиях в области моделирования процессов, нейросетевая классификация состояния оборудования, нейросетевое прогнозирование состояния, цифровые двойники и др.
                `}
            ],
            "paragraph_9":[
            {"image": true, "image_path": "./content/page_content/img1_4.png","img_sign": " "}
            ],
            "paragraph_10":[
            {"image": true, "image_path": "./content/page_content/img1_5.png","img_sign": " ", no_sgn: true},
            {"text": `
                <p><b class='blue_header'>Цифровой двойник</b> – это виртуальная модель, которая воспроизводит характеристики и поведение реального объекта или системы. Он используется для диагностики и испытания электрического и электромеханического оборудования по нескольким причинам:</p>
                <p><b>1. Тестирование сценариев.</b> Цифровой двойник позволяет тестировать различные сценарии работы оборудования без риска для реального объекта. Это помогает определить оптимальные настройки и условия эксплуатации.</p>
                <p><b>2. Прогнозирование отказов.</b> С помощью цифрового двойника можно анализировать данные о работе оборудования и прогнозировать возможные отказы. Это позволяет планировать техническое обслуживание и предотвращать аварийные ситуации.</p>
                <p><b>3. Оптимизация процессов.</b> Цифровой двойник даёт возможность оптимизировать процессы управления оборудованием, что приводит к повышению эффективности и снижению затрат.</p>
                <p><b>4. Обучение персонала.</b> Виртуальные модели могут использоваться для обучения персонала, позволяя им практиковаться в управлении и обслуживании оборудования в безопасной среде.</p>
                <p><b>5. Анализ данных.</b> Цифровой двойник собирает и анализирует большие объёмы данных о работе оборудования, что способствует более глубокому пониманию его поведения и улучшению процессов принятия решений.</p>
                <p><b>6. Улучшение качества продукции.</b> Моделирование различных условий эксплуатации помогает выявить слабые места и улучшить качество продукции, повышая её надёжность и долговечность.</p>
                `},
            ],
            "paragraph_11":[
            {"image": true, "image_path": "./content/page_content/img1_6.png","img_sign": " ", no_sgn: true},
            {"text": `
                <p><b class='blue_header'>Нейросетевые модели</b> при диагностике и испытании электрического и электромеханического оборудования могут применяться для решения следующих задач:</p>
                <p><b>1. Распознавание образов.</b> Нейросети способны анализировать визуальные данные, полученные с помощью тепловизионной диагностики или других методов неразрушающего контроля. Они могут автоматически обнаруживать дефекты, такие как трещины, коррозия или износ, на основе анализа изображений.</p>
                <p><b>2. Прогнозирование отказов.</b> Используя исторические данные о работе оборудования, нейросети могут предсказывать возможные отказы до того, как они произойдут. Это позволяет планировать техническое обслуживание и предотвращать аварийные ситуации.</p>
                <p><b>3. Оптимизация процессов.</b> Нейросетевые алгоритмы могут оптимизировать процессы управления оборудованием, например, путём автоматического регулирования параметров работы в зависимости от условий эксплуатации.</p>
                <p><b>4. Анализ данных.</b> Нейросети могут обрабатывать большие объёмы данных, собранных с датчиков или в результате испытаний. Они помогают выявлять закономерности и тенденции, которые могут быть незаметны при ручном анализе.</p>
                <p><b>5. Обучение персонала.</b> Виртуальные тренажёры на основе нейросетей позволяют персоналу практиковаться в управлении и обслуживании оборудования в безопасной среде.</p>
                <p><b>6. Улучшение качества продукции.</b> Моделирование различных условий эксплуатации с помощью нейросетей помогает выявить слабые места и улучшить качество продукции, повышая её надёжность и долговечность.</p>
                <p><b>7. Управление активами.</b> Нейросетевые модели могут использоваться для управления активами предприятия, включая планирование закупок, управление складом и распределение ресурсов.</p>
                <p><b>8. Автоматизация тестирования.</b> Нейросети могут автоматизировать процесс тестирования оборудования, выполняя повторяющиеся задачи и освобождая время специалистов для более сложных задач.</p>
                `}
            ],
            "paragraph_12":[
            {"text": `
                <p><b class='blue_header'>Интернет вещей (IoT)</b> играет важную роль в диагностике электрического оборудования. Он позволяет собирать и анализировать данные о работе оборудования в реальном времени, что способствует более глубокому пониманию его поведения и улучшению процессов принятия решений. <br>
                <p>Вот несколько примеров того, как IoT может быть использован для диагностики электрического оборудования:</p>

                <p><b>Мониторинг состояния оборудования.</b> Нейросети способны анализировать визуальные данные, полученные с помощью тепловизионной диагностики или других методов неразрушающего контроля. Они могут автоматически обнаруживать дефекты, такие как трещины, коррозия или износ, на основе анализа изображений.</p>

                <p><b>Прогнозирование отказов</b> Используя исторические данные о работе оборудования, нейросети могут предсказывать возможные отказы до того, как они произойдут. Это позволяет планировать техническое обслуживание и предотвращать аварийные ситуации.</p>

                <p><b>Оптимизация процессов.</b> Нейросетевые алгоритмы могут оптимизировать процессы управления оборудованием, например, путём автоматического регулирования параметров работы в зависимости от условий эксплуатации.</p>

                <p><b>Управление активами.</b> Нейросети могут обрабатывать большие объёмы данных, собранных с датчиков или в результате испытаний. Они помогают выявлять закономерности и тенденции, которые могут быть незаметны при ручном анализе.</p>

                <p><b>Повышение безопасности.</b> Виртуальные тренажёры на основе нейросетей позволяют персоналу практиковаться в управлении и обслуживании оборудования в безопасной среде.</p>

                В целом, IoT является мощным инструментом для диагностики и обслуживания электрического оборудования. Он помогает предприятиям повысить эффективность, снизить затраты и обеспечить безопасность своих сотрудников.
                `}
            ],
            "paragraph_13":[
            {"text": `
                <p><b class='blue_header'>Дополненная реальность (AR)</b> – это технология, которая позволяет добавлять визуальную информацию в реальный мир. Она может быть использована для диагностики электрического и электромеханического оборудования следующим образом:<br>

                <p><b>1. Визуализация данных.</b> AR-устройства могут отображать данные о работе оборудования в виде графиков, диаграмм и других визуальных элементов. Это позволяет операторам быстро получать доступ к важной информации и принимать обоснованные решения.</p>

                <p><b>2. Тренинги и обучение.</b> С помощью AR можно создавать обучающие материалы, которые помогут операторам лучше понять, как работает оборудование. Например, можно создать виртуальные модели оборудования, которые будут отображаться в реальном мире с помощью AR-устройств.</p>

                <p><b>3. Удаленная диагностика.</b> AR может использоваться для удалённой диагностики оборудования. Операторы могут использовать AR-устройства для получения доступа к данным о работе оборудования, даже если они находятся на расстоянии от него.</p>

                <p><b>4. Интерактивные инструкции.</b> AR может предоставлять интерактивные инструкции по обслуживанию и ремонту оборудования. Это может помочь операторам быстрее и эффективнее выполнять задачи по техническому обслуживанию.</p>

                <p><b>5. Отладка и тестирование.</b> AR может помочь в отладке и тестировании нового оборудования. Операторы могут использовать AR-устройства для визуализации данных о работе нового оборудования и выявления возможных проблем.</p>

                <p><b>6. Повышение безопасности.</b> AR может повысить безопасность операторов при работе с оборудованием. Например, AR-устройства могут предупреждать операторов о потенциальных опасностях и предоставлять им инструкции по безопасному выполнению задач.</p>
                `},
            ],
            "paragraph_14":[
            {"image": true, "image_path": "./content/page_content/img1_7.png","img_sign": " "}
            ],
            "paragraph_15":[
                {"text": `
                    <p><b class='blue_header'>SCADA (Supervisory Control And Data Acquisition)</b> – это система сбора, обработки, визуализации и управления данными в реальном времени. Она широко используется для мониторинга и контроля различных процессов, включая диагностику электрического и электромеханического оборудования.<br>
                    Вот несколько примеров того, как SCADA может быть использована для диагностики такого оборудования:</p>
    
                    <p><b>Сбор данных.</b> SCADA-системы могут собирать данные с датчиков, установленных на оборудовании, таких как температура, вибрация, давление и т. д. Это позволяет получить полную картину состояния оборудования и выявить потенциальные проблемы.</p>
    
                    <p><b>Визуализация данных.</b> Собранные данные могут быть визуализированы с помощью SCADA-систем в виде графиков, диаграмм и других элементов. Это упрощает анализ данных и принятие решений.</p>
    
                    <p><b>Управление оборудованием.</b> SCADA-системы позволяют операторам управлять оборудованием, например, изменять параметры работы или выполнять техническое обслуживание. Это повышает эффективность и безопасность работы..</p>
    
                    <p><b>Уведомления о событиях.</b> SCADA-системы могут уведомлять операторов о важных событиях, таких как превышение допустимых значений параметров или отказ оборудования. Это помогает быстро реагировать на проблемы и предотвращать аварии.</p>
    
                    <p><b>Отчёты и аналитика.</b> SCADA-системы предоставляют отчёты и аналитику на основе собранных данных. Это позволяет анализировать работу оборудования, выявлять тенденции и принимать обоснованные решения.</p>
                    `},
            ],
    },
    "index_2":{
        "subtitle": "Что такое «прогрузка автоматических выключателей» и как она проводится?",
        "step_of_popup": "Что такое «прогрузка автоматических выключателей» и как она проводится",
        "test":[
            {"type": 1},
            {"answers": [
                "Это проверка срабатывания автоматических выключателей при различных токах короткого замыкания. Проводится путём подачи на выключатель тока, превышающего номинальный",
                "Это измерение сопротивления автоматических выключателей. Проводится с помощью омметра",
                "Это контроль температуры автоматических выключателей. Проводится инфракрасным термографом"
            ]},
            {"correct_answer": [0]}
        ],
    },
    "index_3":{
        "subtitle": "Изучите устройство и конструктивные особенности асинхронных электрических машин переменного тока.",
        "step_of_popup": "Изучите устройство и конструктивные особенности асинхронных электрических машин переменного тока",
        "paragraph_1":[
            {"text": "Асинхронные двигатели играют ключевую роль в преобразовании электрической энергии в механическую и являются основой электропривода для большинства механизмов, используемых в различных отраслях экономики."},
            {"text": "<b class='blue_header'>1) Устройство трехфазного асинхронного электродвигателя с короткозамкнутым ротором </b>"}
            //{"text2": "<b class='blue_header big_rectangle'>I. Общие положения</b>"},
        ],
        "paragraph_2":[
            {"image": true, "image_path": "./content/page_content/img3.png", "img_sign": " "}
        ],
        "paragraph_3":[
            {"image": true, "image_path": "./content/page_content/img4.png", "img_sign": "Сердечник статора трехфазного асинхронного электродвигателя: 1 – лист; <br> 2 – сердечник статора"},
            {"text": `<p>В состав статора двигателя входят корпус, сердечник и трёхфазная обмотка. Корпус обычно изготавливают из чугуна или алюминиевых сплавов. Сердечник статора состоит из штампованных листов электротехнической стали толщиной 0,3 или 0,5 мм, покрытых изоляционным лаком. Такая конструкция называется «шихтованной» и позволяет уменьшить потери в сердечнике от вихревых токов, возникающих при работе электродвигателя.</p>
                <p>На внутренней стороне сердечника есть пазы, в которые уложена трёхфазная обмотка из изолированного провода. Обмотки-фазы расположены симметрично под углом 120° друг к другу. Начала и концы обмоток имеют специальную маркировку.</p>
                <p>Ротор асинхронного электродвигателя включает вал, который опирается на подшипники, сердечник и обмотку. Сердечник ротора также изготавливается из штампованных листов электротехнической стали.</p>`}
        ],
        "paragraph_4":[
            {"text": "<b class='blue_header'>Маркировка обмоток статора асинхронного электродвигателя </b>"},
            {"text2": "<img src='./content/page_content/img5.png'>"}
        ],
        "paragraph_5":[
            {"text": "На наружной стороне сердечника есть пазы, в которые помещены медные или алюминиевые стержни обмотки ротора без изоляции. Концы стержней надёжно соединены с кольцами посредством сварки или литья под давлением. Таким образом формируется короткозамкнутая обмотка ротора, которая по форме напоминает колесо для белки."}
        ],
        "paragraph_6":[
            {"image": true, "image_path": "./content/page_content/img6.png", "img_sign":"Короткозамкнутая обмотка ротора асинхронного электродвигателя"}
        ],
    },
    "index_4":{
        "subtitle": "Соотнесите части асинхронного электродвигателя с короткозамкнутым ротором на рисунке с их названиями.",
        "step_of_popup": "Соотнесите части асинхронного электродвигателя с короткозамкнутым ротором на рисунке с их названиями",
        "test": [{
            "type": 5
        }, {
            "leftColumn": 2
        }, {
            "rightColumn": 3
        }, {
            "image": "./content/tests_content/test_img1.png"
        }, {"answers": ['подшипниковый щит', 'трехфазная обмотка', 'статор', 'ротор', 'сердечник']}
        ],
    },
    "index_5":{
        "subtitle": "Ознакомьтесь с принципом действия асинхронного электродвигателя.",
        "step_of_popup": "Ознакомьтесь с принципом действия асинхронного электродвигателя.",
        "paragraph_1": [
            {"text": "При подключении обмотки статора к сети трехфазного переменного тока в статоре образуется вращающееся магнитное поле. А вращения магнитного поля определяется по формуле:"},
            {"text2": "<p><img src='./content/page_content/img7.png'></p>"}
        ],
        "paragraph_2": [
            {"text": "где n<sub>0</sub> – частота вращения магнитного поля, об/мин; <br> f – частота тока, Гц; <br> р – число пар магнитных полюсов двигателя."},
            {"text": "Силовые линии вращающегося магнитного поля пересекают стержни короткозамкнутой обмотки ротора, и в них индуктируется электродвижущая сила, которая вызывает появление тока и магнитного потока в роторе двигателя. Взаимодействие магнитного поля статора с током ротора создает механический вращающий момент, под действием которого ротор начинает вращаться. Частота вращения ротора несколько меньше частоты вращения магнитного поля, поэтому двигатель называется асинхронным. <br> Величина, характеризующая отставание ротора от магнитного поля в относительных единицах, называется скольжением и определяется по формуле:"},
            {"text2": "<p><img src='./content/page_content/img8.png'></p>"}
        ],
        "paragraph_3": [
            {"text": "где n<sub>0</sub> – частота вращения магнитного поля, об/мин; <br> n<sub>1</sub> – номинальная частота вращения ротора, об/мин."},
            {"text": "Скольжение величина безразмерная, иногда она может быть выражена в процентах (%), в этом случае скольжение может быть определено по формуле:"},
            {"text2": "<p><img src='./content/page_content/img9.png'></p>"}
        ]
    },
    "index_6":{
        "subtitle": "Тест по проверке теоретических знаний формул принципа действия асинхронного двигателя. <br><b class='grey_header'> Установите соответствие между буквенным обозначением и его названием в формулах вращения магнитного поля и формулы скольжения.</b>",
        "step_of_popup": "Тест по проверке знаний принципа действия асинхронного двигателя",
        "test":[
            {"type": 9},
            {"description": " "},
            {"definitions": [
                "f",
                "р",
                "<p>n<sub>0</sub></p>",
                "<p>n<sub>1</sub></p>",
                "S"
            ]},
            {"answers": [
                "<span class='p_custom'>частота тока, Гц </span>",
                "частота вращения магнитного поля, об/мин",
                "число пар магнитных полюсов двигателя",
                "номинальная частота вращения ротора, об/мин",
                "скольжение"
            ]},
            {"correct_answer_type_10": [1, 3, 2, 4, 5]},
            {"image": true, "image_path": "./content/tests_content/06_01.png", "image_sgn": "blablabla"}
        ],
    },
    "index_7":{
        "subtitle": "Изучите схемы включения асинхронного двигателя в сеть.",
        "step_of_popup": "Изучите схемы включения асинхронного двигателя в сеть",
        "paragraph_1": [
            {"text": `<p>Для включения двигателя в сеть его статорные обмотки должны быть соединены в «звезду» или в «треугольник». Обозначения для выводов обмоток двигателей выглядят следующим образом: начала обмоток помечаются символами С1, С2, С3, а соответствующие им концы – С4, С5, С6.</p>
                <p>Чтобы подключить двигатель по схеме «звезда», нужно объединить все концы обмоток (С4, С5, С6) в одной точке, а начала обмоток (С1, С2, С3) подключить к фазам А, В, С трёхфазной сети. Можно также соединить вместе все начала обмоток, а напряжение трёхфазной сети подвести к концам обмоток – двигатель будет работать так же.</p>
                <p>Для подключения двигателя по схеме «треугольник» следует выполнить следующие соединения: конец первой обмотки С4 соединить с началом второй обмотки С2, конец второй обмотки С5 соединить с началом третьей обмотки С3, конец третьей обмотки С6 соединить с началом первой обмотки С1. Места соединений обмоток подключить к трём фазам сети.</p>
                `} 
        ],
        "paragraph_2": [
            {"text":`<div class='two_img_custom'>
                    <div>
                        <img src='./content/page_content/img10.png'>
                    </div>
                    <div>
                        <img src='./content/page_content/img11.png'>
                    </div>
                </div>` }
        ],
        "paragraph_3": [
            {"text": `
                <p style='text-align: center'><b>Схема включения обмоток асинхронного двигателя:</b> <br>
                а – соединения на щитке зажимов; б – схемы включения
                </p>
                <p>Если линейное напряжение в трёхфазной сети (напряжение между двумя фазами) соответствует большему значению, указанному в технической документации двигателя, то обмотки следует соединять по схеме «звезда».</p>
                <p>Если линейное напряжение сети равно меньшему напряжению, указанному на двигателе, то обмотку статора необходимо соединить треугольником.</p>
                <p>В случае, когда сетевое напряжение не совпадает ни с одним из напряжений, указанных на двигателе, использовать такой двигатель в данной сети нельзя. Неправильный выбор схемы соединения обмоток двигателя может привести к его выходу из строя.</p>
                `}
        ],
    },
    "index_8":{
        "subtitle": "Укажите название соединения обмоток включения в щитке зажимов асинхронного двигателя, указанного на изображении.</b>",
        "step_of_popup": "Укажите название соединения обмоток включения в щитке зажимов асинхронного двигателя, указанного на изображении",
        "test":[
            {"type": 2},
            {"description": " "},
            {"test_with_text_2": "Соединение {=звезда,Звезда}"},
            {"image": true, "image_path": "./content/tests_content/08_01.png"}
        ],
    },
    "index_9":{
        "subtitle": "Ознакомьтесь с испытанием корпусной изоляции электрической машины.",
        "step_of_popup": "Ознакомьтесь с испытанием корпусной изоляции электрической машины",
        "paragraph_1": [
            {"text": "Чтобы проверить состояние изоляции и определить, готова ли машина к дальнейшим испытаниям, измеряют сопротивление изоляции её обмоток относительно корпуса и между обмотками."},
            {"text": `<b>Измерения рекомендуется проводить:</b>
                <ul>
                <li>в практически холодном состоянии машины – перед началом испытаний по соответствующей программе;</li> 
                <li>независимо от температуры обмоток – до и после испытаний изоляции обмоток на электрическую прочность относительно корпуса машины и между обмотками переменным напряжением.</li> 
                </ul><br>
                `},
        ],
        "paragraph_2": [
            {"image": true, "image_path": "./content/page_content/img12.png","img_sign": " "}
        ],
        "paragraph_3": [
            {"text": "При измерении сопротивления изоляции обмоток, номинальное напряжение которых превышает 6000 В и которые имеют значительную ёмкость по отношению к корпусу, рекомендуется использовать <b> мегаомметр на 2500 </b> В с моторным приводом или со статической схемой выпрямления переменного напряжения."},
            {"text": "Чтобы измерить сопротивление изоляции относительно корпуса машины и между обмотками, нужно проводить измерения поочерёдно для каждой цепи, имеющей отдельные выводы, при этом все прочие цепи должны быть электрически соединены с корпусом машины."},
            {"text": "Для обмоток трёхфазного тока, которые жёстко соединены в звезду или треугольник, измерение сопротивления изоляции проводится для всей обмотки по отношению к корпусу."},
            {"text": "Изолированные обмотки, защитные конденсаторы и другие устройства, постоянно соединённые с корпусом машины, на время измерения сопротивления их изоляции должны быть отсоединены от корпуса машины."},
            {"text": "Чтобы измерить сопротивление изоляции обмоток, которые охлаждаются водой напрямую, нужно использовать <b> мегаомметр с внутренним экранированием.</b> При этом зажим мегаомметра, соединённый с экраном, следует подключать к водосборным коллекторам, не имеющим металлической связи с внешней системой питания обмоток дистиллятом."},
            {"text": "После завершения измерения сопротивления изоляции каждой цепи её нужно разрядить, подключив к заземлённому корпусу машины."},
            {"text": "Для обмоток с номинальным напряжением 3000 В и выше продолжительность подключения к корпусу должна составлять:"}
        ],
        "paragraph_4": [
            {"text":`<div class='two_img_custom'>
                <div>
                    <img src='./content/page_content/img13.png'>
                </div>
                <div>
                    <img src='./content/page_content/img14.png'>
                </div>
                </div>`}
        ],
        "paragraph_5": [
            {"text": "При использовании мегаомметра на 2500 В длительность подключения к корпусу должна составлять не менее трёх минут независимо от мощности машины."},
            {"text": "Чтобы измерить сопротивление изоляции встроенных датчиков температуры (термопреобразователей сопротивления), нужно использовать мегаомметр с напряжением 500 В."},
            {"text": "Измерение сопротивления изоляции изолированных подшипников и масляных уплотнений вала относительно корпуса следует проводить при температуре окружающей среды мегаомметром с напряжением не менее 1000 В."}
        ],
        "paragraph_6": [
            {"text": "<b class='blue_header'>Сопротивление изоляции R<sub>из</sub></b> основной показатель состояния изоляции статора и ротора электродвигателя."},
            {"text": "Одновременно с измерением сопротивления изоляции обмотки статора определяют коэффициент абсорбции. Измерение сопротивления изоляции ротора проводится у синхронных электродвигателей и электродвигателей с фазным ротором на напряжение 3 кВ и выше или мощностью более 1 МВт. Сопротивление изоляции ротора должно быть не ниже 0,2 МОм."},
            {"text": "Обязательно определять коэффициент абсорбции в процессе эксплуатации нужно только для электродвигателей с напряжением выше 3 кВ или мощностью более 1 МВт."},
            {"text": `
                <b>Подготовка инструментов для измерения:</b>
                <ul>
                <li>Проверить заряд батареи или аккумулятора мегаомметра типа MIC-2500;</li> 
                <li>Установить необходимое значение испытательного напряжения;</li>
                <li>Если используется стрелочный прибор типа ЭСО202, разместить его горизонтально;</li>
                <li>Для ЭС0202 выбрать нужный предел измерений, шкалу прибора и установить значение испытательного напряжения мегомметра;</li>
                <li>Убедиться в исправности мегаомметра: замкнуть между собой измерительные щупы и вращать рукоятку генератора со скоростью 120–140 оборотов в минуту – стрелка.</li>
                </ul><br>
                `},
            {"text": "Перед проведением измерения необходимо открыть вводное устройство электродвигателя, протереть изоляторы от пыли и загрязнения и подключить мегаомметр согласно схемы:"},
        ],
        "paragraph_7": [
            {"image": true, "image_path": "./content/page_content/img15.png","img_sign": "Измерение сопротивления изоляции обмоток электродвигателя"}
          //  {"text2":"<img style='width:50%; margin:0 auto;' src='./content/page_content/img15.png'><br><b style='margin:0 auto;' >Измерение сопротивления изоляции обмоток электродвигателя</b>"}
        ],   
        "paragraph_8": [
            {"text": "На рисунке А представлена схема подключения мегаомметра к тестируемому электродвигателю. В данном случае обмотки электродвигателя соединены внутри корпуса в звезду или треугольник, и разъединение в борно (клеммной коробке электродвигателя, где соединяются выводы обмоток) невозможно."},
            {"text": "В такой ситуации мегаомметр подключается к любому зажиму статора электродвигателя. Затем измеряется сопротивление изоляции всей обмотки относительно корпуса."},
            {"text": "На рисунке Б показано, как измеряется сопротивление изоляции у электродвигателя. Это происходит отдельно для каждой части обмотки, при этом другие части обмотки в данный момент закорачиваются и соединяются с землёй."},
            {"text": "Во время измерения сопротивления изоляции показания мегаомметра снимаются каждые 15 секунд. Через 60 секунд после начала измерения фиксируется итоговое значение сопротивления. Отношение показаний R60 к R15 называется коэффициентом абсорбции."},
            {"text": "Для электродвигателей с номинальным напряжением 0,4 кВ (до 1000 В) одноминутное измерение изоляции мегаомметром на 2500 В равноценно высоковольтному испытанию."},
            {"text": "При измерении сопротивления изоляции обмоток статора у синхронных электродвигателей необходимо закоротить и заземлить обмотку ротора. Это нужно сделать, чтобы не повредить изоляцию ротора."}
        ]
    },
    "index_10":{
        "subtitle": "Проверка знаний по требованиям проверки испытания корпусной изоляции электрической машины<br> <b class='grey_header'>Какое из следующих утверждений является правильным при измерении сопротивления изоляции обмоток электрической машины? Выберите все правильные варианты</b>",
        "step_of_popup": "Проверка знаний по требованиям проверки испытания корпусной изоляции электрической машины",
        "test":[
            {"type": 1},
            {"answers": [
                "Измерение следует осуществлять независимо от температуры обмоток",
                "Измерение сопротивления изоляции обмоток должно проводиться только при номинальном напряжении 1000 В",
                "Изучение коэффициента абсорбции обязательно только для всех электродвигателей независимо от их напряжения и мощности",
                "При измерении обмоток с номинальным напряжением свыше 6000 В следует использовать мегаомметр на 2500 В с моторным приводом"
            ]},
            {"correct_answer": [0, 3]}
        ],
    },
    "index_11":{
        "subtitle": "Изучите схемы включения асинхронного двигателя в сеть.",
        "step_of_popup": "Изучите схемы включения асинхронного двигателя в сеть",
        "paragraph_1": [
            {"image": true, "image_path": "./content/page_content/img16.png","img_sign": "Рисунок 1. Схема измерения сопротивления обмоток постоянному току"},
            {"text": "<b class='blue_header'>Измерение проводится двумя способами:</b> с помощью моста постоянного тока или с использованием амперметра и вольтметра. В обоих случаях ориентируются на падение напряжения на обмотке. При измерении методом падения напряжения ток не должен превышать 1/5 номинального тока обмотки электродвигателя."},
            {"text": "В зависимости от величины измеряемого сопротивления выбирают определённую схему (см. рисунок 1). Схему, представленную на рисунке 1а, применяют для измерения малых сопротивлений мощных электродвигателей. Вольтметр в этом случае подключается после амперметра, то есть без учёта его сопротивления. Схему рисунка 1б используют для измерения больших сопротивлений маломощных электродвигателей."},
            {"text": "Если использовать мост постоянного тока, например Р333, для измерения сопротивления, нужно подключить зажимы моста к зажимам электродвигателя. Затем следует провести измерения в соответствии с инструкцией по эксплуатации моста."},
            {"text": "Важно учитывать, что если измерение выполняется без разборки схемы соединения «звезда» или «треугольник», то измеряется не одна часть обмотки, а несколько. Например, при соединении двигателя в «звезду» измеряются две части обмотки, соединённые последовательно, а при соединении в «треугольник» – одна часть обмотки с двумя другими частями, подключёнными параллельно."},
            {"text": "Нужно разбирать схему, потому что в паспортах электродвигателей (особенно мощных, таких как СТД) сопротивление постоянному току обычно указано для отдельной фазы обмотки (например: С1-С4, С2-С5 и С3-С6)."},
            {"text": "Чтобы измерить сопротивление постоянному току обмотки ротора, нужно освободить обмотку от лишних элементов (резисторов у асинхронного электродвигателя с фазным ротором или диодов и тиристоров системы возбуждения синхронного электродвигателя). Измерение сопротивления производится также, как и измерение сопротивления обмоток статора."},
        ],
        "paragraph_2": [
            {"text": "У асинхронных двигателей с фазным ротором измерение выполняется по фазам для последующего сравнения и определения пригодности к работе. В случае синхронных двигателей достаточно одного измерения, чтобы сравнить результаты с заводскими данными или результатами предыдущих испытаний."},
            {"text": "Для маломощных электродвигателей, которые используются в некритичных механизмах, станках и т.п., можно измерять сопротивление обмоток статора с помощью простых мультиметров (цифровых или стрелочных). Важно обеспечить надёжный контакт с зажимом (или зажимами) измеряемой обмотки. Сравнение значений сопротивления производится на основе показаний мультиметра. Как правило, точности простых мультиметров вполне достаточно для оценки пригодности электродвигателя к эксплуатации."}
        ],
    },
    "index_12":{
        "subtitle": "Укажите, как измеряется сопротивление обмоток статора маломощных электродвигателей.",
        "step_of_popup": "Укажите, как измеряется сопротивление обмоток статора маломощных электродвигателей",
        "test":[
            {"type": 1},
            {"answers": [
                "С помощью осциллографа",
                "С помощью простейших мультиметров",
                "С помощью RLC-метра",
                "С помощью мегаомметра"
            ]},
            {"correct_answer": [1]}
        ],
    },
    "index_13":{
        "subtitle": "Ознакомьтесь с испытанием повышенным напряжением промышленной частоты.",
        "step_of_popup": "Ознакомьтесь с испытанием повышенным напряжением промышленной частоты",
        "paragraph_1": [
            {"image": true, "image_path": "./content/page_content/img17.png","img_sign": "Рисунок 2. Схема испытания повышенным напряжением промышленной частоты"},
            {"text": "Перед тем как проводить испытание повышенным напряжением промышленной частоты, нужно собрать испытательную схему, изображённую на рисунке 2 (один из возможных вариантов)."},
            {"text": "Если испытания проводятся по схеме, представленной на рисунке 2 под буквой «б», важно внимательно следить за тем, чтобы свободные обмотки (на которые не подаётся повышенное напряжение) были замкнуты накоротко и соединены с землёй. Эта схема рекомендуется для всех электродвигателей. <br> Во время испытаний необходимо соблюдать правила безопасности."},
            {"text": "Если испытания проводятся по схеме, изображённой на рисунке 2 под буквой «б», то напряжение промышленной частоты последовательно прикладывается к каждой части обмотки."},
            {"text": "Такой подход (разделение соединения «звездой») особенно важен для мощных электродвигателей. Это связано с тем, что при испытании всей обмотки сразу большая ёмкость изоляции может привести к возникновению значительного тока утечки."},
            {"text": "Кроме того, разделение обмотки и последующее индивидуальное испытание каждой её части позволяет проверить изоляцию между обмотками в местах их пересечения, не приближаясь при этом к корпусу двигателя."}
        ],
        "paragraph_2": [
            {"text": "В цепь между высоковольтной обмоткой испытательного трансформатора и землёй включают миллиамперметр (желательно с блокирующей кнопкой для его защиты), чтобы измерить ток утечки. Хотя его значения не нормируются, они могут служить дополнительным критерием оценки результатов испытаний."},
            {"text": "Один из выводов миллиамперметра подключается к корпусу (земле), а другой – к выводу высоковольтного трансформатора, который должен быть соединён с землёй."},
            {"text": "Если проводятся испытания обмоток статора синхронных электродвигателей и асинхронных машин с фазным ротором повышенным напряжением, необходимо закоротить и заземлить обмотку ротора, чтобы избежать возможного пробоя. <br> Наблюдение за токами утечки во время высоковольтных испытаний электродвигателей не является обязательным. "}
        ],
    },
    "index_14":{
        "subtitle": "Укажите, какой элемент схемы испытаний должен быть заземлён.",
        "step_of_popup": "Укажите, какой элемент схемы испытаний должен быть заземлён",
        "test":[
            {"type": 1},
            {"answers": [
                "Обмотки статора",
                "Высоковольтный трансформатор",
                "Миллиамперметр",
                "Все перечисленные элементы"
            ]},
            {"correct_answer": [3]}
        ],
    },
    "index_15":{
        "subtitle": "Ознакомьтесь с испытанием работы электродвигателя на холостом ходу и испытанием возбудителей.",
        "step_of_popup": "Ознакомьтесь с испытанием работы электродвигателя на холостом ходу и испытание возбудителей",
        "paragraph_1": [
           // {"image": true, "image_path": "./content/page_content/img16.png","img_sign": "Рисунок 1. Схема измерения сопротивления постоянному току"},
            {"text": "<b class='blue_header'>1) Испытание работы электродвигателя на холостом ходу</b> "},
            {"text": "После всех предыдущих испытаний и измерений выполняется проверка. Она заключается в измерении тока холостого хода электродвигателя и контроле его работы в течение 40–30 минут при номинальном напряжении сети."},
            {"text": "Во время испытания синхронного электродвигателя нужно следить за током возбуждения: с помощью регулятора станции управления необходимо добиться минимального тока статора, близкого к единице косинуса."}
        ],
        "paragraph_2": [
            {"text": "<b class='blue_header'>2) Испытание возбудителей</b> "},
            {"text": "Это испытание предназначено для синхронных электродвигателей."},
            {"text": "Если на электродвигателях установлены безщёточные системы возбуждения типа БВУ, необходимо проверить полупроводниковые элементы (диоды, тиристоры), а также измерить сопротивление обмотки возбуждения и обмоток генератора."},
            {"text": "Чтобы провести проверку полупроводниковых элементов, нужно разобрать схему – отсоединить хотя бы один из электродов каждого полупроводникового элемента. Места отсоединения можно найти на рисунке 3."}
        ],
        "paragraph_3": [
            {"image": true, "image_path": "./content/page_content/img18.png", "img_sign": "Проверка полупроводниковых элементов БВУ с помощью мегаомметра и измерение сопротивления обмоток БВУ постоянному току"},
        ],
        "paragraph_": [
            {"text": "После того как схема разобрана, проводится проверка диодов и тиристоров БВУ с использованием мегаомметра. <br> Чтобы проверить диоды, нужно подключить плюсовой вывод мегаомметра сначала к аноду, а затем к катоду и замерить сопротивление по стандартной схеме. Если мегаомметр подключён напрямую (плюсовой вывод – к аноду), сопротивление элемента будет нулевым. При обратном подключении оно должно быть не менее 10 МОм (при условии, что диод исправен). <br> Для проверки тиристоров проводятся аналогичные измерения, но в этом случае сопротивление должно быть не менее 10 МОм в обоих направлениях – как при прямом, так и при обратном подключении мегаомметра."},
            {"text": "Помимо измерения сопротивления тиристора мегаомметром, нужно проверить его работоспособность с помощью мультиметра или тестера (можно использовать функцию «прозвонки»). Для этого подключите мультиметр к аноду и катоду тиристора. Прибор должен показать большое сопротивление. Затем присоедините управляющий электрод к катоду (подайте напряжение смещения на управляющий электрод), тиристор должен открыться, и мультиметр покажет нулевое сопротивление. <br> Проверка полупроводниковых элементов проводится как снаружи, так и внутри БВУ <br> Измерить обмотку БВУ постоянным током также можно после того, как схема была разобрана. Используйте для этого мост постоянного тока."},
        ],
    },
        "index_16": {
        "subtitle": "Тест по проверке знаний  работы испытание электродвигателя на холостом ходу и испытание возбудителей",
        "step_of_popup": "Тест по проверке знаний  работы испытание электродвигателя на холостом ходу и испытание возбудителей",
        "test": [{
            "type": 8
        }, {
            "description": "Заполните пропуски в следующем утверждении:"
        }, {
            "test_with_text_3": "Испытание работы электродвигателя на холостом ходу включает в себя измерение {=1} холостого тока и контроль работы электродвигателя в течение {=2} минут при номинальном напряжении сети. При проверке полупроводниковых элементов безщёточной системы возбуждения типа БВУ необходимо {=3} хотя бы один из электродов каждого полупроводникового элемента, чтобы проверить его {=4} с помощью мегаомметра."
        }, {
            "options_test_with_text_3": {
                "1": ["тока", "напряжения", "мощности"],
                "2": ["20-30", "30-40", "10-15"],
                "3": ["соединить", "отсоединить", "закоротить"],
                "4": ["работоспособность", "мощность", "эффективность"]
            }
        }, {
            "correctAnswers_test_with_text_3": {
                "1": "тока",
                "2": "30-40",
                "3": "отсоединить",
                "4": "работоспособность"
            }
        }, {
            "image": false,
            "image_path": "./content/video/test_video.mp4"
        }], 
    },
    "index_17": {
        "subtitle": "Результаты",
        "step_of_popup": "Результаты",
        "result": []
    }
}
window.dataLoaded = true;